export const CityIcon = ({ className }: { className?: string }) => (
    <svg
      className={className}
      width="77"
      height="67"
      viewBox="0 0 77 67"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M33.2586 0.462952L0.216553 33.1448L33.5105 65.7116C39.035 56.0559 37.0909 43.8562 28.8388 36.3958L25.2429 33.1448L31.898 25.8512C38.3392 18.7921 38.9084 8.17002 33.2586 0.462952Z"
        fill="currentColor"
      />
      <path
        d="M43.8229 1.46295L76.8649 34.1448L43.5709 66.7116C38.0464 57.0559 39.9906 44.8562 48.2426 37.3958L51.8385 34.1448L45.1834 26.8512C38.7423 19.7921 38.173 9.17002 43.8229 1.46295Z"
        fill="currentColor"
        fillOpacity="0.7" // или убери, если нужен одинаковый цвет
      />
    </svg>
  );
